Revit.Elements.TextElement.Value
Text Value

Revit.Elements.TextElement.FontFamilyName
FontFamily Name

Revit.Elements.TextElement.Bold
Is Bold

Revit.Elements.TextElement.Italic
Is Italic

Revit.Elements.TextElement.FontSize
Fontsize in ft

Revit.Elements.TextElement.Location
Location

Revit.Elements.TextElement.Scale
Constant Scale for Font Size

Revit.Elements.TextElement.Alignment
Horizontal alignment

Revit.Elements.TextElement.Rotation
Rotation

Revit.Elements.TextElement.InternalElement
Internal Revit Element

Revit.Elements.TextElement.InternalRevitElement
Reference to the Element

Revit.Elements.TextElement.InternalSetElement(Autodesk.Revit.DB.Element)
Set Internal Element
element:

Revit.Elements.TextElement.InternalSetTextSettings(System.String,System.Boolean,System.Boolean,System.Double,System.String,Autodesk.DesignScript.Geometry.Point,Autodesk.Revit.DB.HorizontalTextAlignment,System.Double)
Set Internal Text Display Settings
value:
bold:
italic:
size:
fontFamilyName:
location:
alignment:
rotation:

Revit.Elements.TextElement.CreateText(System.String,System.Boolean,System.Boolean,System.Windows.Media.FontFamily,System.Double,System.Windows.Point)
Create the outline geometry based on the formatted text.
text:
bold:
italic:
family:
size:
location:
Returns:

Revit.Elements.TextElement.Tessellate(Autodesk.DesignScript.Interfaces.IRenderPackage,Autodesk.DesignScript.Interfaces.TessellationParameters)
Empty method - we don't want to tessellate text automatically
but it seems we need this method to correctly import this library into Dynamo.
See description in base class.
package:
parameters:

Revit.Elements.TextElement.RotatePoint(System.Windows.Point,System.Double)
Rotate point around 0,0
point:
angle: Angle in degrees
Returns: Rotated point